https://pyquantnews.com/how-to-build-an-automated-quant-database/

Use SQLite to build a database
Download stock data for free
Store the data in a database
Run it all automatically

In [1]:
import sqlite3
import pandas as pd

# connect to the database
con = sqlite3.connect(r"C:\Users\Jonat\Documents\MEGAsync\MEGAsync\Github\sp500_data\sp500_market_data.db")

# # simple select statement
# df_1 = pd.read_sql_query("SELECT * from stock_data where symbol='SPY'", con)

# # where statement
# df_2 = pd.read_sql_query("SELECT * from stock_data where symbol='SPY' and volume > 90000000", con)

pd.read_sql_query("SELECT * from stock_data where date='2023-10-13T00:00:00'", con)

,date,symbol,open,high,low,close,adj_close,volume
0,2023-10-13T00:00:00,A,108.019997,110.610001,106.820000,110.510002,110.510002,2807600.0
1,2023-10-13T00:00:00,AAL,11.870000,12.040000,11.680000,11.720000,11.720000,48056300.0
2,2023-10-13T00:00:00,AAPL,181.419998,181.929993,178.139999,178.850006,178.850006,51427100.0
3,2023-10-13T00:00:00,ABBV,148.949997,149.660004,147.339996,147.960007,147.960007,4304700.0
4,2023-10-13T00:00:00,ABNB,127.610001,129.839996,123.550003,124.080002,124.080002,4926500.0
...,...,...,...,...,...,...,...,...
501,2023-10-13T00:00:00,YUM,115.989998,117.010002,115.529999,116.879997,116.879997,1352900.0
502,2023-10-13T00:00:00,ZBH,102.330002,104.769997,102.000000,104.300003,104.300003,1556600.0
503,2023-10-13T00:00:00,ZBRA,210.589996,210.589996,205.190002,206.919998,206.919998,460900.0
504,2023-10-13T00:00:00,ZION,35.689999,35.860001,34.330002,34.570000,34.570000,2202500.0
505,2023-10-13T00:00:00,ZTS,173.419998,175.729996,173.000000,174.380005,174.380005,1287400.0

In [13]:
import sqlite3
import pandas as pd

# connect to the database
con = sqlite3.connect(r"C:\Users\Jonat\Documents\MEGAsync\MEGAsync\Github\sp500_data\sp500_market_data.db")
pd.read_sql_query("SELECT * from stock_data", con)

,date,symbol,open,high,low,close,adj_close,volume
0,2021-01-04T00:00:00,SPY,375.309998,375.450012,364.820007,368.790009,354.197388,110210800.0
1,2021-01-05T00:00:00,SPY,368.100006,372.500000,368.049988,371.329987,356.636871,66426200.0
2,2021-01-06T00:00:00,SPY,369.709991,376.980011,369.119995,373.549988,358.768982,107997700.0
3,2021-01-07T00:00:00,SPY,376.100006,379.899994,375.910004,379.100006,364.099457,68766800.0
4,2021-01-08T00:00:00,SPY,380.589996,381.489990,377.100006,381.260010,366.174011,71677200.0
...,...,...,...,...,...,...,...,...
352070,2023-10-16T00:00:00,YUM,117.550003,119.129997,117.110001,118.449997,118.449997,1627700.0
352071,2023-10-16T00:00:00,ZBH,105.080002,105.430000,103.680000,105.050003,105.050003,1284400.0
352072,2023-10-16T00:00:00,ZBRA,207.320007,216.000000,206.839996,214.970001,214.970001,425300.0
352073,2023-10-16T00:00:00,ZION,35.090000,36.009998,34.689999,35.919998,35.919998,2388500.0
352074,2023-10-16T00:00:00,ZTS,175.009995,176.539993,173.669998,175.179993,175.179993,1264400.0

In [10]:
import pandas_market_calendars as mcal
import datetime as dt

# Define your desired date range
start_date = '2023-01-01'
end_date = dt.datetime.today().strftime('%Y-%m-%d')

# Get the valid days within the specified date range
valid_days = mcal.get_calendar('NYSE').valid_days(start_date=start_date, end_date=end_date)

#Extract the last date from the valid days, -2 as we will always be running at 12 noon HKT/SGT
sec_last_biz_day = valid_days[-3].strftime('%Y-%m-%d')
last_business_day = valid_days[-1].strftime('%Y-%m-%d')

print(sec_last_biz_day)
print(last_business_day)

2023-10-16
2023-10-18

In [9]:
import yfinance as yf
yf.download('AAPL', start="2023-10-16", end="2023-10-18")

[*********************100%***********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2023-10-16,176.750000,179.080002,176.509995,178.720001,178.720001,52517000
2023-10-17,176.649994,178.419998,174.800003,177.149994,177.149994,57515400

In [31]:
import yfinance as yf
def get_stock_data(symbol, start, end):
    data = yf.download(symbol, start=start, end=end)
    data.insert(0, "symbol", symbol)
    
    data.rename(columns={
        "symbol": "symbol",
        "Open": "open",
        "High": "high",
        "Low": "low",
        "Close": "close",
        "Adj Close": "adj_close",
        "Volume": "volume"
    }, inplace=True)

    return data

# Function to format numeric values with commas
def format_with_commas(value):
    if isinstance(value, (int, float)):
        return '{:,.0f}'.format(value)  # Format as integer with commas
    return value  # Keep non-numeric values unchanged

df = get_stock_data('AAPL', '2023-10-01', '2023-10-03')
df['volume']= df['volume'].apply(format_with_commas)
df

In [40]:
data = yf.download('AAPL', start='2023-01-01', end='2023-01-05')
data

[*********************100%***********************]  1 of 1 completed

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2023-01-03,130.279999,130.899994,124.169998,125.070000,124.538658,112117500
2023-01-04,126.889999,128.660004,125.080002,126.360001,125.823189,89113600

In [37]:
# Function to format numeric values with commas
def format_with_commas(value):
    if isinstance(value, (int, float)):
        return '{:,.0f}'.format(value)  # Format as integer with commas
    return value  # Keep non-numeric values unchanged

df = get_stock_data('AAPL', '2023-10-01', '2023-10-03')
df['volume']= df['volume'].apply(format_with_commas)
df

[*********************100%***********************]  1 of 1 completed

,symbol,open,high,low,close,adj_close,volume
Date,,,,,,,
2023-10-02,AAPL,171.220001,174.300003,170.929993,173.75,173.75,"52,164,500"

# USe this code when manipulating datafreame

In [ ]:
# # Function to format numeric values with commas
# def format_with_commas(value):
#     if isinstance(value, (int, float)):
#         return '{:,.0f}'.format(value)  # Format as integer with commas
#     return value  # Keep non-numeric values unchanged


def get_stock_data(symbol, start, end,):
    with StringIO() as buf, redirect_stdout(buf):
        data = yf.download(symbol, start=start, end=end)
    data.insert(0, "symbol", symbol)
    
    data.rename(columns={
        "symbol": "symbol",
        "Open": "open",
        "High": "high",
        "Low": "low",
        "Close": "close",
        "Adj Close": "adj_close",
        "Volume": "volume"
    }, inplace=True)

    # data['volume'].apply(format_with_commas)

In [4]:
import sqlite3
import pandas as pd

# connect to the database
con = sqlite3.connect(r"C:\Users\Jonat\Documents\MEGAsync\MEGAsync\Github\sp500_data\test\test.db")
pd.read_sql_query("SELECT * from stock_data", con)

,Date,symbol,open,high,low,close,adj_close,volume
4,2023-10-03T00:00:00,SPY,425.059998,427.369995,420.179993,421.589996,421.589996,103760600.0
5,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000.0
6,2023-10-02T00:00:00,SPY,426.619995,428.600006,424.459991,427.309998,427.309998,83798600.0
7,2023-10-03T00:00:00,SPY,425.059998,427.369995,420.179993,421.589996,421.589996,103760600.0
8,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000.0

In [5]:
pd.read_sql_query("SELECT * FROM stock_data WHERE symbol = 'SPY' AND SUBSTR(date, 1, 10) BETWEEN '2023-01-01T00:00:00' AND '2023-10-04T00:00:00'", con)

,Date,symbol,open,high,low,close,adj_close,volume
0,2023-10-02T00:00:00,SPY,426.619995,428.600006,424.459991,427.309998,427.309998,83798600.0
1,2023-10-03T00:00:00,SPY,425.059998,427.369995,420.179993,421.589996,421.589996,103760600.0
2,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000.0
3,2023-10-02T00:00:00,SPY,426.619995,428.600006,424.459991,427.309998,427.309998,83798600.0
4,2023-10-03T00:00:00,SPY,425.059998,427.369995,420.179993,421.589996,421.589996,103760600.0
5,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000.0
6,2023-10-02T00:00:00,SPY,426.619995,428.600006,424.459991,427.309998,427.309998,83798600.0
7,2023-10-03T00:00:00,SPY,425.059998,427.369995,420.179993,421.589996,421.589996,103760600.0
8,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000.0

In [7]:
pd.read_sql_query("SELECT * FROM stock_data WHERE Date LIKE '%2023-10-04%'", con)

,Date,symbol,open,high,low,close,adj_close,volume
0,2023-10-04T00:00:00,SPY,422.070007,425.429993,420.559998,424.660004,424.660004,87453000

# DELETE SQL TABLE

In [10]:
import sqlite3

# Connect to the SQLite database
con = sqlite3.connect(r"C:\Users\Jonat\Documents\MEGAsync\MEGAsync\Github\sp500_data\test\test.db")

# Create a cursor object
cursor = con.cursor()

# Specify the table name you want to delete data from
table_name = "stock_data"

# Construct and execute the SQL DELETE statement
delete_query = f"DELETE FROM {table_name};"
cursor.execute(delete_query)

# Commit the changes to the database
con.commit()

# Close the database connection
con.close()

In [11]:
con = sqlite3.connect(r"C:\Users\Jonat\Documents\MEGAsync\MEGAsync\Github\sp500_data\test\test.db")
pd.read_sql_query("SELECT * from stock_data", con)

Empty DataFrame
Columns: [Date, symbol, open, high, low, close, adj_close, volume]
Index: []